Oryx-Embedded/CycloneTCP/drivers/mac/am243x_eth_driver.c
/**
 * @file am243x_eth_driver.c
 * @brief AM243x Ethernet MAC driver
 *
 * @section License
 *
 * SPDX-License-Identifier: GPL-2.0-or-later
 *
 * Copyright (C) 2010-2026 Oryx Embedded SARL. All rights reserved.
 *
 * This file is part of CycloneTCP Open.
 *
 * This program is free software; you can redistribute it and/or
 * modify it under the terms of the GNU General Public License
 * as published by the Free Software Foundation; either version 2
 * of the License, or (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program; if not, write to the Free Software Foundation,
 * Inc., 51 Franklin Street, Fifth Floor, Boston, MA  02110-1301, USA.
 *
 * @author Oryx Embedded SARL (www.oryx-embedded.com)
 * @version 2.6.2
 **/

//Switch to the appropriate trace level
#define TRACE_LEVEL NIC_TRACE_LEVEL

//Dependencies
#include <hw_include/csl_cpswitch.h>
#include <kernel/dpl/AddrTranslateP.h>
#include <drivers/pinmux.h>
#include <drivers/udma/udma_priv.h>
#include <networking/enet/utils/include/enet_apputils.h>
#include <networking/enet/utils/include/enet_appmemutils.h>
#include <networking/enet/utils/include/enet_appmemutils_cfg.h>
#include "core/net.h"
#include "drivers/mac/am243x_eth_driver.h"
#include "debug.h"

//MDIO input clock frequency
#define MDIO_INPUT_CLK 250000000
//MDIO output clock frequency
#define MDIO_OUTPUT_CLK 1000000

//Underlying network interface (port 1)
static NetInterface *nicDriverInterface1 = NULL;
//Underlying network interface (port 2)
static NetInterface *nicDriverInterface2 = NULL;

//TX DMA handle
static EnetDma_TxChHandle txChHandle = NULL;
//RX DMA handle
static EnetDma_RxChHandle rxChHandle = NULL;

//TX packet queue
static EnetDma_PktQ txFreePacketQueue;
//RX packet queue
static EnetDma_PktQ rxFreePacketQueue;


/**
 * @brief AM243x Ethernet MAC driver (port1)
 **/

const NicDriver am243xEthPort1Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   am243xEthInitPort1,
   am243xEthTick,
   am243xEthEnableIrq,
   am243xEthDisableIrq,
   am243xEthEventHandler,
   am243xEthSendPacket,
   am243xEthUpdateMacAddrFilter,
   am243xEthUpdateMacConfig,
   am243xEthWritePhyReg,
   am243xEthReadPhyReg,
   FALSE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief AM243x Ethernet MAC driver (port2)
 **/

const NicDriver am243xEthPort2Driver =
{
   NIC_TYPE_ETHERNET,
   ETH_MTU,
   am243xEthInitPort2,
   am243xEthTick,
   am243xEthEnableIrq,
   am243xEthDisableIrq,
   am243xEthEventHandler,
   am243xEthSendPacket,
   am243xEthUpdateMacAddrFilter,
   am243xEthUpdateMacConfig,
   am243xEthWritePhyReg,
   am243xEthReadPhyReg,
   FALSE,
   TRUE,
   TRUE,
   FALSE
};


/**
 * @brief AM243x Ethernet MAC initialization (port 1)
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t am243xEthInitPort1(NetInterface *interface)
{
   error_t error;
   uint32_t temp;
   volatile CSL_Xge_cpswRegs *ctrlRegs;
   volatile CSL_AleRegs *aleRegs;
   volatile CSL_main_ctrl_mmr_cfg0Regs *mmrRegs;

   //Debug message
   TRACE_INFO("Initializing AM243x Ethernet MAC (port 1)...\r\n");

   //Initialize CPSW instance
   am243xEthInitInstance(interface);

   //Save underlying network interface
   nicDriverInterface1 = interface;

   //PHY transceiver initialization
   error = interface->phyDriver->init(interface);
   //Any error to report?
   if(error)
   {
      return error;
   }

   //Unspecified MAC address?
   if(macCompAddr(&interface->macAddr, &MAC_UNSPECIFIED_ADDR))
   {
      //Point to the CTRL_MMR0 registers
      mmrRegs = (volatile CSL_main_ctrl_mmr_cfg0Regs *) CSL_CTRL_MMR0_CFG0_BASE;

      //Use the factory preprogrammed MAC address
      interface->macAddr.b[0] = (mmrRegs->MAC_ID1 >> 8) & 0xFF;
      interface->macAddr.b[1] = mmrRegs->MAC_ID1 & 0xFF;
      interface->macAddr.b[2] = (mmrRegs->MAC_ID0 >> 24) & 0xFF;
      interface->macAddr.b[3] = (mmrRegs->MAC_ID0 >> 16) & 0xFF;
      interface->macAddr.b[4] = (mmrRegs->MAC_ID0 >> 8) & 0xFF;
      interface->macAddr.b[5] = mmrRegs->MAC_ID0 & 0xFF;

      //Generate the 64-bit interface identifier
      macAddrToEui64(&interface->macAddr, &interface->eui64);
   }

   //Point to the CPSW0_CONTROL registers
   ctrlRegs = (volatile CSL_Xge_cpswRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_NU_OFFSET);
   //Point to the CPSW0_ALE registers
   aleRegs = (volatile CSL_AleRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_ALE_OFFSET);

   //Set CMD_IDLE bit to 1 in the port control register
   ctrlRegs->ENETPORT[0].PN_MAC_CONTROL_REG |= CSL_XGE_CPSW_PN_MAC_CONTROL_REG_CMD_IDLE_MASK;

   //Wait for IDLE bit to be set to 1 in the port status register
   while((ctrlRegs->ENETPORT[0].PN_MAC_STATUS_REG & CSL_XGE_CPSW_PN_MAC_STATUS_REG_IDLE_MASK) == 0)
   {
   }

   //Set SOFT_RESET bit to 1 in the port software reset register
   ctrlRegs->ENETPORT[0].PN_MAC_SOFT_RESET_REG |= CSL_XGE_CPSW_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MASK;

   //Wait for SOFT_RESET bit to be cleared to confirm reset completion
   while((ctrlRegs->ENETPORT[0].PN_MAC_SOFT_RESET_REG &
      CSL_XGE_CPSW_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MASK) != 0)
   {
   }

   //Set port state (forwarding)
   temp = aleRegs->I0_ALE_PORTCTL0[1] & ~CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_MASK;
   aleRegs->I0_ALE_PORTCTL0[1] = temp | (3 << CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_SHIFT);

   //Set the MAC address of the station
   ctrlRegs->ENETPORT[0].PN_SA_H_REG = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   ctrlRegs->ENETPORT[0].PN_SA_L_REG = interface->macAddr.w[2];

   //Configure VLAN identifier and VLAN priority
   ctrlRegs->ENETPORT[0].PN_PORT_VLAN_REG = (0 << CSL_XGE_CPSW_PN_PORT_VLAN_REG_PORT_PRI_SHIFT) |
      (CPSW_PORT1 << CSL_XGE_CPSW_PN_PORT_VLAN_REG_PORT_VID_SHIFT);

   //Add a VLAN entry in the ALE table
   am243xEthAddVlanEntry(CPSW_PORT1, CPSW_PORT1);

   //Add a VLAN/unicast address entry in the ALE table
   am243xEthAddVlanAddrEntry(CPSW_PORT1, CPSW_PORT1, &interface->macAddr);

