Oryx-Embedded/CycloneTCP/drivers/mac/am243x_eth_driver.c
   //Enable CPSW statistics
   ctrlRegs->STAT_PORT_EN_REG |= CSL_XGE_CPSW_STAT_PORT_EN_REG_P1_STAT_EN_MASK;

   //Enable TX and RX
   ctrlRegs->ENETPORT[0].PN_MAC_CONTROL_REG = CSL_XGE_CPSW_PN_MAC_CONTROL_REG_GMII_EN_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief AM243x Ethernet MAC initialization (port 2)
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t am243xEthInitPort2(NetInterface *interface)
{
   error_t error;
   uint32_t temp;
   volatile CSL_Xge_cpswRegs *ctrlRegs;
   volatile CSL_AleRegs *aleRegs;

   //Debug message
   TRACE_INFO("Initializing AM243x Ethernet MAC (port 2)...\r\n");

   //Initialize CPSW instance
   am243xEthInitInstance(interface);

   //Save underlying network interface
   nicDriverInterface2 = interface;

   //PHY transceiver initialization
   error = interface->phyDriver->init(interface);
   //Any error to report?
   if(error)
   {
      return error;
   }

   //Point to the CPSW0_CONTROL registers
   ctrlRegs = (volatile CSL_Xge_cpswRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_NU_OFFSET);
   //Point to the CPSW0_ALE registers
   aleRegs = (volatile CSL_AleRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_ALE_OFFSET);

   //Set CMD_IDLE bit to 1 in the port control register
   ctrlRegs->ENETPORT[1].PN_MAC_CONTROL_REG |= CSL_XGE_CPSW_PN_MAC_CONTROL_REG_CMD_IDLE_MASK;

   //Wait for IDLE bit to be set to 1 in the port status register
   while((ctrlRegs->ENETPORT[1].PN_MAC_STATUS_REG & CSL_XGE_CPSW_PN_MAC_STATUS_REG_IDLE_MASK) == 0)
   {
   }

   //Set SOFT_RESET bit to 1 in the port software reset register
   ctrlRegs->ENETPORT[1].PN_MAC_SOFT_RESET_REG |= CSL_XGE_CPSW_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MASK;

   //Wait for SOFT_RESET bit to be cleared to confirm reset completion
   while((ctrlRegs->ENETPORT[1].PN_MAC_SOFT_RESET_REG &
      CSL_XGE_CPSW_PN_MAC_SOFT_RESET_REG_SOFT_RESET_MASK) != 0)
   {
   }

   //Set port state (forwarding)
   temp = aleRegs->I0_ALE_PORTCTL0[2] & ~CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_MASK;
   aleRegs->I0_ALE_PORTCTL0[2] = temp | (3 << CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_SHIFT);

   //Set the MAC address of the station
   ctrlRegs->ENETPORT[1].PN_SA_H_REG = interface->macAddr.w[0] | (interface->macAddr.w[1] << 16);
   ctrlRegs->ENETPORT[1].PN_SA_L_REG = interface->macAddr.w[2];

   //Configure VLAN identifier and VLAN priority
   ctrlRegs->ENETPORT[1].PN_PORT_VLAN_REG = (0 << CSL_XGE_CPSW_PN_PORT_VLAN_REG_PORT_PRI_SHIFT) |
      (CPSW_PORT2 << CSL_XGE_CPSW_PN_PORT_VLAN_REG_PORT_VID_SHIFT);

   //Add a VLAN entry in the ALE table
   am243xEthAddVlanEntry(CPSW_PORT2, CPSW_PORT2);

   //Add a VLAN/unicast address entry in the ALE table
   am243xEthAddVlanAddrEntry(CPSW_PORT2, CPSW_PORT2, &interface->macAddr);

   //Enable CPSW statistics
   ctrlRegs->STAT_PORT_EN_REG |= CSL_XGE_CPSW_STAT_PORT_EN_REG_P2_STAT_EN_MASK;

   //Enable TX and RX
   ctrlRegs->ENETPORT[1].PN_MAC_CONTROL_REG = CSL_XGE_CPSW_PN_MAC_CONTROL_REG_GMII_EN_MASK;

   //Accept any packets from the upper layer
   osSetEvent(&interface->nicTxEvent);

   //Successful initialization
   return NO_ERROR;
}


/**
 * @brief Initialize CPSW instance
 * @param[in] interface Underlying network interface
 **/

void am243xEthInitInstance(NetInterface *interface)
{
   int32_t status;
   uint32_t i;
   uint32_t temp;
   uint32_t coreId;
   uint32_t coreKey;
   Cpsw_Cfg cpswConfig;
   EnetOsal_Cfg osalConfig;
   EnetUtils_Cfg utilsConfig;
   EnetUdma_Cfg dmaConfig;
   EnetUdma_OpenTxChPrms txChCfg;
   EnetUdma_OpenRxFlowPrms rxChCfg;
   Enet_IoctlPrms ioctlParams;
   EnetPer_AttachCoreOutArgs attachCoreOutArgs;
   Enet_Handle enetHandle;
   Udma_DrvHandle udmaHandle;
   EnetDma_Pkt *packetInfo;
   volatile CSL_Xge_cpswRegs *ctrlRegs;
   volatile CSL_AleRegs *aleRegs;
   volatile CSL_MdioRegs *mdioRegs;
   uint8_t macAddr[ENET_MAC_ADDR_LEN];

   //Initialization sequence is performed once
   if(nicDriverInterface1 == NULL && nicDriverInterface2 == NULL)
   {
      uint32_t txChNum = 0;
      uint32_t rxFlowIdx = 0;
      uint32_t rxStartFlowIdx = 0;

      //Retrieve core ID
      coreId = EnetSoc_getCoreId();

      //Select the interface mode (MII/RMII/RGMII) and configure pin muxing
      am243xEthInitGpio(interface);

      //Initialize configuration structures
      memset(&cpswConfig, 0, sizeof(Cpsw_Cfg));
      memset(&dmaConfig, 0, sizeof(EnetUdma_Cfg));

      //Initialize OS abstraction layer
      Enet_initOsalCfg(&osalConfig);
      Enet_initUtilsCfg(&utilsConfig);
      Enet_init(&osalConfig, &utilsConfig);

      //Debug message
      TRACE_INFO("  Initializing memory...\r\n");

      //Initialize memory
      status = EnetMem_init();
      //Check status code
      if(status != ENET_SOK)
      {
         //Debug message
         TRACE_ERROR("Failed to initialize memory (status = %d)\r\n", status);
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Initialize packet queue for free TX packets
      EnetQueue_initQ(&txFreePacketQueue);

      //Debug message
      TRACE_INFO("  Initializing UDMA driver...\r\n");

      //Open UDMA driver
      udmaHandle = EnetAppUtils_udmaOpen(ENET_CPSW_3G, NULL);
      //Invalid handle?
      if(udmaHandle == NULL)
      {
         //Debug message
         TRACE_ERROR("Failed to open UDMA driver\r\n");
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Debug message
      TRACE_INFO("  Initializing CPSW clocks...\r\n");
      //Enable CPSW peripheral clocks
      EnetAppUtils_enableClocks(ENET_CPSW_3G, 0);

      //Initialize DMA configuration
      dmaConfig.rxChInitPrms.dmaPriority = UDMA_DEFAULT_RX_CH_DMA_PRIORITY;
      dmaConfig.hUdmaDrv = udmaHandle;

      //Set CPSW parameters
      Enet_initCfg(ENET_CPSW_3G, 0, &cpswConfig, sizeof(Cpsw_Cfg));
      cpswConfig.vlanCfg.vlanAware = false;
      cpswConfig.hostPortCfg.removeCrc = false;
      cpswConfig.hostPortCfg.padShortPacket = true;
      cpswConfig.hostPortCfg.passCrcErrors = false;
      cpswConfig.dmaCfg = &dmaConfig;

