Oryx-Embedded/CycloneTCP/drivers/mac/am243x_eth_driver.c
      //Debug message
      TRACE_INFO("  Initializing RM configuration...\r\n");
      //Initialize RM configuration
      EnetAppUtils_initResourceConfig(ENET_CPSW_3G, coreId, &cpswConfig.resCfg);

      //Debug message
      TRACE_INFO("  Initializing CPSW peripheral...\r\n");

      //Open CPSW peripheral
      enetHandle = Enet_open(ENET_CPSW_3G, 0, &cpswConfig, sizeof(Cpsw_Cfg));
      //Invalid handle?
      if(enetHandle == NULL)
      {
         //Debug message
         TRACE_ERROR("Failed to open CPSW peripheral\r\n");
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Debug message
      TRACE_INFO("  Attaching core with RM...\r\n");

      //Set IOCTL parameters
      ENET_IOCTL_SET_INOUT_ARGS(&ioctlParams, &coreId, &attachCoreOutArgs);

      //Attach the core with RM
      status = Enet_ioctl(enetHandle, coreId, ENET_PER_IOCTL_ATTACH_CORE,
         &ioctlParams);
      //Check status code
      if(status != ENET_SOK)
      {
         //Debug message
         TRACE_ERROR("Failed to attach core with RM (status = %d)\r\n", status);
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Save core key
      coreKey = attachCoreOutArgs.coreKey;

      //Set DMA TX channel parameters
      EnetDma_initTxChParams(&txChCfg);
      txChCfg.hUdmaDrv = udmaHandle;
      txChCfg.notifyCb = NULL;
      txChCfg.cbArg = NULL;
      txChCfg.useGlobalEvt = true;

      //Use default common parameters
      EnetAppUtils_setCommonTxChPrms(&txChCfg);

      //Debug message
      TRACE_INFO("  Opening DMA TX channel...\r\n");

      //Open the DMA TX channel
      EnetAppUtils_openTxCh(enetHandle, coreKey, coreId, &txChNum,
         &txChHandle, &txChCfg);
      //Invalid handle?
      if(txChHandle == NULL)
      {
         //Debug message
         TRACE_ERROR("Failed to open DMA TX channel\r\n");
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Allocate TX packet queue
      for(i = 0; i < ENET_MEM_NUM_TX_PKTS; i++)
      {
         //Allocate a new packet
         packetInfo = EnetMem_allocEthPkt(NULL, ENET_MEM_LARGE_POOL_PKT_SIZE,
            ENETDMA_CACHELINE_ALIGNMENT);

         //Sanity check
         EnetAppUtils_assert(packetInfo != NULL);

         //Add the packet to the queue
         EnetQueue_enq(&txFreePacketQueue, &packetInfo->node);
      }

      //Debug message
      TRACE_INFO("  TX queue initialized with %u packets\r\n",
         EnetQueue_getQCount(&txFreePacketQueue));

      //Set DMA TX channel parameters
      EnetDma_initRxChParams(&rxChCfg);
      rxChCfg.hUdmaDrv = udmaHandle;
      rxChCfg.notifyCb = am243xEthRxIrqHandler;
      rxChCfg.cbArg = NULL;
      rxChCfg.useGlobalEvt = true;
      rxChCfg.flowPrms.sizeThreshEn = 0;

      //Use default common parameters
      EnetAppUtils_setCommonRxFlowPrms(&rxChCfg);

      //Open the DMA RX channel
      EnetAppUtils_openRxFlowForChIdx(ENET_CPSW_3G, enetHandle, coreKey,
         coreId, true, 0, &rxStartFlowIdx, &rxFlowIdx, macAddr, &rxChHandle,
         &rxChCfg);
      //Invalid handle?
      if(rxChHandle == NULL)
      {
         //Debug message
         TRACE_ERROR("Failed to open DMA RX channel\r\n");
         //Fatal error
         EnetAppUtils_assert(false);
      }

      //Initialize RX packet queue
      EnetQueue_initQ(&rxFreePacketQueue);

      //Allocate RX packet queue
      for(i = 0; i < ENET_MEM_NUM_RX_PKTS; i++)
      {
         //Allocate a new packet
         packetInfo = EnetMem_allocEthPkt(NULL, ENET_MEM_LARGE_POOL_PKT_SIZE,
            ENETDMA_CACHELINE_ALIGNMENT);

         //Sanity check
         EnetAppUtils_assert(packetInfo != NULL);

         //Add the packet to the queue
         EnetQueue_enq(&rxFreePacketQueue, &packetInfo->node);
      }

      //Debug message
      TRACE_INFO("  RX queue initialized with %u packets\r\n",
         EnetQueue_getQCount(&rxFreePacketQueue));

      //Submit all packets
      EnetDma_submitRxPktQ(rxChHandle, &rxFreePacketQueue);

      //Point to the CPSW0_CONTROL registers
      ctrlRegs = (volatile CSL_Xge_cpswRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_NU_OFFSET);
      //Point to the CPSW0_ALE registers
      aleRegs = (volatile CSL_AleRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_ALE_OFFSET);
      //Point to the CPSW0_MDIO registers
      mdioRegs = (volatile CSL_MdioRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_MDIO_OFFSET);

      //Enable ALE and clear ALE address table
      aleRegs->ALE_CONTROL = CSL_ALE_ALE_CONTROL_ENABLE_ALE_MASK |
         CSL_ALE_ALE_CONTROL_CLEAR_TABLE_MASK;

      //For dual MAC mode, configure VLAN aware mode
      aleRegs->ALE_CONTROL |= CSL_ALE_ALE_CONTROL_ALE_VLAN_AWARE_MASK;

      //Set host port state (forwarding)
      temp = aleRegs->I0_ALE_PORTCTL0[0] & ~CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_MASK;
      aleRegs->I0_ALE_PORTCTL0[0] = temp | (3 << CSL_ALE_I0_ALE_PORTCTL0_I0_REG_P0_PORTSTATE_SHIFT);

      //Configure host port
      ctrlRegs->P0_CONTROL_REG = 0;

      //Set the maximum frame length
      temp = ctrlRegs->P0_RX_MAXLEN_REG & ~CSL_XGE_CPSW_P0_RX_MAXLEN_REG_RX_MAXLEN_MASK;
      ctrlRegs->P0_RX_MAXLEN_REG = temp | (ETH_MAX_FRAME_SIZE << CSL_XGE_CPSW_P0_RX_MAXLEN_REG_RX_MAXLEN_SHIFT);

      //Enable host port
      ctrlRegs->CONTROL_REG = CSL_XGE_CPSW_CONTROL_REG_P0_RX_PAD_MASK |
         CSL_XGE_CPSW_CONTROL_REG_P0_ENABLE_MASK;

      //Enable CPSW statistics
      ctrlRegs->STAT_PORT_EN_REG |= CSL_XGE_CPSW_STAT_PORT_EN_REG_P0_STAT_EN_MASK;

      //Calculate the MDC clock divider to be used
      temp = (MDIO_INPUT_CLK / MDIO_OUTPUT_CLK) - 1;

      //Initialize MDIO interface
      mdioRegs->CONTROL_REG = CSL_MDIO_CONTROL_REG_ENABLE_MASK |
         CSL_MDIO_CONTROL_REG_FAULT_DETECT_ENABLE_MASK |
         (temp & CSL_MDIO_CONTROL_REG_CLKDIV_MASK);
   }
}


/**
 * @brief GPIO configuration
 * @param[in] interface Underlying network interface
 **/

__weak_func void am243xEthInitGpio(NetInterface *interface)
{
//TMDS243GPEVM evaluation board?
#if defined(USE_TMDS243GPEVM)
   //MDIO/MDC pins
   const Pinmux_PerCfg_t mdioPins[] =
   {
      //MDIO0_MDC (ball R2)
      {PIN_PRG0_PRU1_GPO19, PIN_MODE(4) | PIN_PULL_DISABLE},
      //MDIO0_MDIO (ball P5)
      {PIN_PRG0_PRU1_GPO18, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},

      //RGMII1_TXC (ball U14)
      {PIN_PRG1_PRU0_GPO10, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_TX_CTL (ball U15)
      {PIN_PRG1_PRU0_GPO9, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_TD0 (ball V15)
      {PIN_PRG1_PRU1_GPO7, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_TD1 (ball V14)
      {PIN_PRG1_PRU1_GPO9, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_TD2 (ball W14)
      {PIN_PRG1_PRU1_GPO10, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_TD3 (ball AA14)
      {PIN_PRG1_PRU1_GPO17, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII1_RXC (ball AA5)
      {PIN_PRG0_PRU0_GPO10, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII1_RX_CTL (ball W6)
      {PIN_PRG0_PRU0_GPO9, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII1_RD0 (ball W5)
      {PIN_PRG0_PRU1_GPO7, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII1_RD1 (ball Y5)
      {PIN_PRG0_PRU1_GPO9, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII1_RD2 (ball V6)
      {PIN_PRG0_PRU1_GPO10, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII1_RD3 (ball V5)
      {PIN_PRG0_PRU1_GPO17, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},

