Oryx-Embedded/CycloneTCP/drivers/mac/am243x_eth_driver.c
      //RGMII2_TXC (ball Y10)
      {PIN_PRG1_PRU1_GPO16, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_TX_CTL (ball Y11)
      {PIN_PRG1_PRU1_GPO15, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_TD0 (ball AA10)
      {PIN_PRG1_PRU1_GPO11, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_TD1 (ball V10)
      {PIN_PRG1_PRU1_GPO12, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_TD2 (ball U10)
      {PIN_PRG1_PRU1_GPO13, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_TD3 (ball AA11)
      {PIN_PRG1_PRU1_GPO14, PIN_MODE(4) | PIN_PULL_DISABLE},
      //RGMII2_RXC (ball U11)
      {PIN_PRG1_PRU1_GPO6, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII2_RX_CTL (ball W12)
      {PIN_PRG1_PRU1_GPO4, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII2_RD0 (ball W11)
      {PIN_PRG1_PRU1_GPO0, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII2_RD1 (ball V11)
      {PIN_PRG1_PRU1_GPO1, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII2_RD2 (ball AA12)
      {PIN_PRG1_PRU1_GPO2, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},
      //RGMII2_RD3 (ball Y12)
      {PIN_PRG1_PRU1_GPO3, PIN_MODE(4) | PIN_INPUT_ENABLE | PIN_PULL_DISABLE},

      //End marker
      {PINMUX_END, PINMUX_END}
   };

   //Configure MDIO/MDC pins
   Pinmux_config(mdioPins, PINMUX_DOMAIN_ID_MAIN);
#endif
}


/**
 * @brief AM243x Ethernet MAC timer handler
 *
 * This routine is periodically called by the TCP/IP stack to handle periodic
 * operations such as polling the link state
 *
 * @param[in] interface Underlying network interface
 **/

void am243xEthTick(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Handle periodic operations
      interface->phyDriver->tick(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Handle periodic operations
      interface->switchDriver->tick(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Enable interrupts
 * @param[in] interface Underlying network interface
 **/

void am243xEthEnableIrq(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Enable Ethernet PHY interrupts
      interface->phyDriver->enableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Enable Ethernet switch interrupts
      interface->switchDriver->enableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief Disable interrupts
 * @param[in] interface Underlying network interface
 **/

void am243xEthDisableIrq(NetInterface *interface)
{
   //Valid Ethernet PHY or switch driver?
   if(interface->phyDriver != NULL)
   {
      //Disable Ethernet PHY interrupts
      interface->phyDriver->disableIrq(interface);
   }
   else if(interface->switchDriver != NULL)
   {
      //Disable Ethernet switch interrupts
      interface->switchDriver->disableIrq(interface);
   }
   else
   {
      //Just for sanity
   }
}


/**
 * @brief AM243x Ethernet MAC receive interrupt
 * @param[in] arg Unused parameter
 **/

void am243xEthRxIrqHandler(void *arg)
{
   bool_t flag;

   //Interrupt service routine prologue
   osEnterIsr();

   //Set event flag
   nicDriverInterface1->nicEvent = TRUE;
   //Notify the TCP/IP stack of the event
   flag = osSetEventFromIsr(&nicDriverInterface1->netContext->event);

   //Interrupt service routine epilogue
   osExitIsr(flag);
}


/**
 * @brief AM243x Ethernet MAC event handler
 * @param[in] interface Underlying network interface
 **/

void am243xEthEventHandler(NetInterface *interface)
{
   static uint32_t temp[ENET_MEM_LARGE_POOL_PKT_SIZE / 4];
   size_t n;
   int32_t status;
   EnetDma_PktQ readyPacketQueue;
   EnetDma_PktQ freePacketQueue;
   EnetDma_Pkt *packetInfo;
   NetRxAncillary ancillary;

   //Initialize packet queues
   EnetQueue_initQ(&readyPacketQueue);
   EnetQueue_initQ(&freePacketQueue);

   //Retrieve received packets
   status = EnetDma_retrieveRxPktQ(rxChHandle, &readyPacketQueue);

   //Return status code
   if(status == ENET_SOK)
   {
      //Get the first received packet
      packetInfo = (EnetDma_Pkt *) EnetQueue_deq(&readyPacketQueue);

      //Consume the received packets and send them back
      while(packetInfo != NULL)
      {
         //Check the port on which the packet was received
         if(packetInfo->rxPortNum == ENET_MAC_PORT_1)
         {
            //Port 1
            interface = nicDriverInterface1;
         }
         else if(packetInfo->rxPortNum == ENET_MAC_PORT_2)
         {
            //Port 2
            interface = nicDriverInterface2;
         }
         else
         {
            //Invalid port
            interface = NULL;
         }

         //Retrieve the length of the frame
         n = packetInfo->userBufLen;

         //Sanity check
         if(interface != NULL)
         {
            //Copy data from the receive buffer
            osMemcpy(temp, packetInfo->bufPtr, (n + 3) & ~3UL);

            //Additional options can be passed to the stack along with the packet
            ancillary = NET_DEFAULT_RX_ANCILLARY;

            //Pass the packet to the upper layer
            nicProcessPacket(interface, (uint8_t *) temp, n, &ancillary);
         }

         //Restore buffer length
         packetInfo->userBufLen = ENET_MEM_LARGE_POOL_PKT_SIZE;

         //Release the received packet
         EnetQueue_enq(&freePacketQueue, &packetInfo->node);

         //Get the next received packet
         packetInfo = (EnetDma_Pkt *) EnetQueue_deq(&readyPacketQueue);
      }

      //Send the processed packets back to the RX queue
      EnetDma_submitRxPktQ(rxChHandle, &freePacketQueue);
   }
}


/**
 * @brief Send a packet
 * @param[in] interface Underlying network interface
 * @param[in] buffer Multi-part buffer containing the data to send
 * @param[in] offset Offset to the first data byte
 * @param[in] ancillary Additional options passed to the stack along with
 *   the packet
 * @return Error code
 **/

error_t am243xEthSendPacket(NetInterface *interface,
   const NetBuffer *buffer, size_t offset, NetTxAncillary *ancillary)
{
   size_t length;
   int32_t status;
   EnetDma_PktQ freePacketQueue;
   EnetDma_PktQ submitPacketQueue;
   EnetDma_Pkt *packetInfo;

