Oryx-Embedded/CycloneTCP/drivers/mac/am243x_eth_driver.c
   //Initialize packet queues
   EnetQueue_initQ(&freePacketQueue);
   EnetQueue_initQ(&submitPacketQueue);

   //Retrieve free TX packets
   status = EnetDma_retrieveTxPktQ(txChHandle, &freePacketQueue);

   //Return status code
   if(status == ENET_SOK)
   {
      //Get the first free packet
      packetInfo = (EnetDma_Pkt *) EnetQueue_deq(&freePacketQueue);

      //Move free packets to the queue
      while(packetInfo != NULL)
      {
         EnetQueue_enq(&txFreePacketQueue, &packetInfo->node);
         packetInfo = (EnetDma_Pkt *) EnetQueue_deq(&freePacketQueue);
      }
   }

   //Retrieve the length of the packet
   length = netBufferGetLength(buffer) - offset;

   //Check the frame length
   if(length > ENET_MEM_LARGE_POOL_PKT_SIZE)
   {
      //The transmitter can accept another packet
      osSetEvent(&interface->nicTxEvent);
      //Report an error
      return ERROR_INVALID_LENGTH;
   }

   //Dequeue a free packet from the queue
   packetInfo = (EnetDma_Pkt *) EnetQueue_deq(&txFreePacketQueue);

   //Any packet available?
   if(packetInfo != NULL)
   {
      //Copy user data to the transmit buffer
      netBufferRead(packetInfo->bufPtr, buffer, offset, length);

      //Prepare an new packet
      packetInfo->userBufLen = length;
      packetInfo->appPriv = NULL;
      packetInfo->tsInfo.enableHostTxTs = false;

      //Select the relevant port number
      if(interface == nicDriverInterface1)
      {
         //Port 1
         packetInfo->txPortNum = ENET_MAC_PORT_1;
      }
      else
      {
         //Port 2
         packetInfo->txPortNum = ENET_MAC_PORT_2;
      }

      //Enqueue the packet for transmission
      EnetQueue_enq(&submitPacketQueue, &packetInfo->node);
   }

   //Transmit all queued packets
   status = EnetDma_submitTxPktQ(txChHandle, &submitPacketQueue);

   //The transmitter can accept another packet
   osSetEvent(&interface->nicTxEvent);

   //Return status code
   if(status == ENET_SOK)
   {
      return NO_ERROR;
   }
   else
   {
      return ERROR_FAILURE;
   }
}


/**
 * @brief Configure MAC address filtering
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t am243xEthUpdateMacAddrFilter(NetInterface *interface)
{
   uint_t i;
   uint_t port;
   MacFilterEntry *entry;

   //Debug message
   TRACE_DEBUG("Updating AM243x ALE table...\r\n");

   //Select the relevant port number
   if(interface == nicDriverInterface1)
   {
      port = CPSW_PORT1;
   }
   else if(interface == nicDriverInterface2)
   {
      port = CPSW_PORT2;
   }
   else
   {
      port = CPSW_PORT0;
   }

   //The MAC address filter contains the list of MAC addresses to accept when
   //receiving an Ethernet frame
   for(i = 0; i < MAC_ADDR_FILTER_SIZE; i++)
   {
      //Point to the current entry
      entry = &interface->macAddrFilter[i];

      //Check whether the ALE table should be updated for the current multicast
      //address
      if(!macCompAddr(&entry->addr, &MAC_UNSPECIFIED_ADDR))
      {
         if(entry->addFlag)
         {
            //Add VLAN/multicast address entry to the ALE table
            am243xEthAddVlanAddrEntry(port, port, &entry->addr);
         }
         else if(entry->deleteFlag)
         {
            //Remove VLAN/multicast address entry from the ALE table
            am243xEthDeleteVlanAddrEntry(port, port, &entry->addr);
         }
      }
   }

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Adjust MAC configuration parameters for proper operation
 * @param[in] interface Underlying network interface
 * @return Error code
 **/

error_t am243xEthUpdateMacConfig(NetInterface *interface)
{
   uint32_t config = 0;
   volatile CSL_Xge_cpswRegs *ctrlRegs;

   //Point to the CPSW0_CONTROL registers
   ctrlRegs = (volatile CSL_Xge_cpswRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_NU_OFFSET);

   //Read MAC control register
   if(interface == nicDriverInterface1)
   {
      config = ctrlRegs->ENETPORT[0].PN_MAC_CONTROL_REG;
   }
   else if(interface == nicDriverInterface2)
   {
      config = ctrlRegs->ENETPORT[1].PN_MAC_CONTROL_REG;
   }

   //1000BASE-T operation mode?
   if(interface->linkSpeed == NIC_LINK_SPEED_1GBPS)
   {
      config |= CSL_XGE_CPSW_PN_MAC_CONTROL_REG_GIG_MASK;
      config &= ~CSL_XGE_CPSW_PN_MAC_CONTROL_REG_IFCTL_A_MASK;
   }
   //100BASE-TX operation mode?
   else if(interface->linkSpeed == NIC_LINK_SPEED_100MBPS)
   {
      config &= ~CSL_XGE_CPSW_PN_MAC_CONTROL_REG_GIG_MASK;
      config |= CSL_XGE_CPSW_PN_MAC_CONTROL_REG_IFCTL_A_MASK;
   }
   //10BASE-T operation mode?
   else
   {
      config &= ~CSL_XGE_CPSW_PN_MAC_CONTROL_REG_GIG_MASK;
      config &= ~CSL_XGE_CPSW_PN_MAC_CONTROL_REG_IFCTL_A_MASK;
   }

   //Half-duplex or full-duplex mode?
   if(interface->duplexMode == NIC_FULL_DUPLEX_MODE)
   {
      config |= CSL_XGE_CPSW_PN_MAC_CONTROL_REG_FULLDUPLEX_MASK;
   }
   else
   {
      config &= ~CSL_XGE_CPSW_PN_MAC_CONTROL_REG_FULLDUPLEX_MASK;
   }

   //Update MAC control register
   if(interface == nicDriverInterface1)
   {
      ctrlRegs->ENETPORT[0].PN_MAC_CONTROL_REG = config;
   }
   else if(interface == nicDriverInterface2)
   {
      ctrlRegs->ENETPORT[1].PN_MAC_CONTROL_REG = config;
   }

   //Successful processing
   return NO_ERROR;
}


/**
 * @brief Write PHY register
 * @param[in] opcode Access type (2 bits)
 * @param[in] phyAddr PHY address (5 bits)
 * @param[in] regAddr Register address (5 bits)
 * @param[in] data Register value
 **/

void am243xEthWritePhyReg(uint8_t opcode, uint8_t phyAddr,
   uint8_t regAddr, uint16_t data)
{
   uint32_t temp;
   volatile CSL_MdioRegs *mdioRegs;

   //Point to the CPSW0_MDIO registers
   mdioRegs = (volatile CSL_MdioRegs *) (CSL_CPSW0_NUSS_BASE + CPSW_MDIO_OFFSET);

   //Valid opcode?
   if(opcode == SMI_OPCODE_WRITE)
   {
      //Set up a write operation
      temp = CSL_MDIO_USER_GROUP_USER_ACCESS_REG_GO_MASK |
         CSL_MDIO_USER_GROUP_USER_ACCESS_REG_WRITE_MASK;

      //PHY address
      temp |= (phyAddr << CSL_MDIO_USER_GROUP_USER_ACCESS_REG_PHYADR_SHIFT) &
         CSL_MDIO_USER_GROUP_USER_ACCESS_REG_PHYADR_MASK;

      //Register address
      temp |= (regAddr << CSL_MDIO_USER_GROUP_USER_ACCESS_REG_REGADR_SHIFT) &
         CSL_MDIO_USER_GROUP_USER_ACCESS_REG_REGADR_MASK;

      //Register value
      temp |= data & CSL_MDIO_USER_GROUP_USER_ACCESS_REG_DATA_MASK;

      //Start a write operation
      mdioRegs->USER_GROUP[0].USER_ACCESS_REG = temp;

